app/controllers/api/users_controller.rb

INSERT INTO "users" ("email", "name", "reason_for_using", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)

        if @user.save