app/controllers/application_controller.rb

  def current_user
    return nil if self.session[:session_token].nil?
    @current_user ||= User.find_by(session_token: self.session[:session_token])
---
SELECT  "users".* FROM "users" WHERE "users"."session_token" = ? LIMIT ?  [["session_token", "hzg-znnw_nGi1t7cjJkARQ"], ["LIMIT", 1]]